       IDENTIFICATION DIVISION.
       PROGRAM-ID. X IS INITIAL PROGRAM2.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       DISPLAY "OK".

       END PROGRAM X.
